reddit_clone/app/models/user.rb

    def generate_unique_random_session_token
        token = SecureRandom.urlsafe_base64
        token = SecureRandom.urlsafe_base64 while User.find_by(session_token: token) != nil
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = generate_unique_random_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-09-02 15:43:09.050777"], ["id", 4]]