reddit_clone/app/controllers/posts_controller.rb

    def create

        @post = Post.new(title: post_params[:title], body: post_params[:body], poster: current_user, sub: Sub.find_by(id: post_params[:sub_id]))

        debugger
        if @post.save!
---
SELECT "posts".* FROM "posts" WHERE "posts"."poster_id" = $1  [["poster_id", 1]]
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "subs" ("title", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test Sub"], ["moderator_id", 1], ["created_at", "2022-09-02 18:38:54.735419"], ["updated_at", "2022-09-02 18:38:54.735419"]]
INSERT INTO "posts" ("title", "body", "url", "poster_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test_title"], ["body", "test_body"], ["url", nil], ["poster_id", 4], ["sub_id", 1], ["created_at", "2022-09-02 20:57:50.003085"], ["updated_at", "2022-09-02 20:57:50.003085"]]