reddit_clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "user1"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2022-09-02 15:12:39.088648"], ["updated_at", "2022-09-02 15:12:39.088648"]]
---
    def create
        @user = User.new(username: params[:user][:username], password: params[:user][:password])

        if @user.save!